{"pageProps":{"note":{"id":"gmrwrsmy4wvb276tynlciw5","title":"Introduction","desc":"","updated":1666884911429,"created":1666884911429,"isDir":false,"custom":{"isDir":false},"fname":"game-references.players-handbook.introduction","type":"note","vault":{"fsPath":"vault"},"contentHash":"a405ed56e29e46bb38f533b11d826b14","links":[],"anchors":{"worlds-of-adventure":{"type":"header","text":"Worlds of Adventure","value":"worlds-of-adventure","line":54,"column":0,"depth":2},"using-this-book":{"type":"header","text":"Using This Book","value":"using-this-book","line":64,"column":0,"depth":2},"how-to-play":{"type":"header","text":"How to Play","value":"how-to-play","line":74,"column":0,"depth":2},"game-dice":{"type":"header","text":"Game Dice","value":"game-dice","line":90,"column":0,"depth":3},"the-d20":{"type":"header","text":"The D20","value":"the-d20","line":102,"column":0,"depth":3},"advantage-and-disadvantage":{"type":"header","text":"Advantage and Disadvantage","value":"advantage-and-disadvantage","line":120,"column":0,"depth":3},"specific-beats-general":{"type":"header","text":"Specific Beats General","value":"specific-beats-general","line":124,"column":0,"depth":3},"round-appropriately":{"type":"header","text":"Round Appropriately","value":"round-appropriately","line":130,"column":0,"depth":3},"targets":{"type":"header","text":"Targets","value":"targets","line":134,"column":0,"depth":3},"ally":{"type":"header","text":"Ally","value":"ally","line":138,"column":0,"depth":4},"friendly-creature":{"type":"header","text":"Friendly Creature","value":"friendly-creature","line":142,"column":0,"depth":4},"hostile-creature":{"type":"header","text":"Hostile Creature","value":"hostile-creature","line":146,"column":0,"depth":4},"adventures":{"type":"header","text":"Adventures","value":"adventures","line":150,"column":0,"depth":2},"the-force-and-technology":{"type":"header","text":"The Force and Technology","value":"the-force-and-technology","line":162,"column":0,"depth":3},"the-three-pillars-of-adventuring":{"type":"header","text":"The Three Pillars of Adventuring","value":"the-three-pillars-of-adventuring","line":172,"column":0,"depth":3},"exploration":{"type":"header","text":"Exploration","value":"exploration","line":176,"column":0,"depth":4},"combat":{"type":"header","text":"Combat","value":"combat","line":184,"column":0,"depth":4}},"children":[],"parent":"zximqrw65ytdx3huy2wrwdq","data":{}},"body":"<h1 id=\"introduction\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#introduction\"></a>Introduction</h1>\n<p>The Dungeons and Dragons roleplaying game is about storytelling in worlds of swords and sorcery. It shares elements with childhood games of make-believe. Like those games, D&#x26;D is driven by imagination. It’s about picturing the towering castle beneath the stormy night sky and imagining how a fantasy adventurer might react to the challenges that scene presents.</p>\n<p>This overhaul is designed as a <em>Star Wars</em> reskinning of the core Dungeons and Dragons experience. The rules are generally the same, and so an experienced player of 5th Edition should have no trouble jumping right in to a <em>Star Wars</em> themed campaign. For the less experienced player, this Introduction will cover the basics of the 5th Edition of Dungeons and Dragons, appropriately reskinned for the setting.</p>\n<p><strong>Game Master (GM):</strong> After traveling the streets of Nar Shaddaa, you find yourself at the entrance to the Black Sun compound. Security cameras scan the surrounding area, and a cadre of bored-looking guardsmen wait impatiently by the door. Two twi’lek urchins plead for handouts from the Black Sun mercenaries, only to be yelled at and pushed away. A shimmering barrier covers the entrance to the compound, with a manned security console on its left side.</p>\n<p><strong>Rickey (playing Vinto):</strong> I want to talk my way into the compound. I approach the guards.</p>\n<p><strong>Drew (playing Dash):</strong> I want to throw a grenade and then shoot them all.</p>\n<p><strong>Eric (playing Kodo):</strong> …</p>\n<p>Unlike a game of make-believe, D&#x26;D gives structure to the stories, a way of determining the consequences of the adventurers’ action. Players roll dice to resolve whether their attacks hit or miss or whether their</p>\n<p><strong>Game Master (GM):</strong> OK, one at a time. Rickey, you’re approaching the guardsmen?</p>\n<p><strong>Rickey:</strong> Yeah. Do they seem to be doing anything?</p>\n<p><strong>GM:</strong> Make a Wisdom check.</p>\n<p><strong>Rickey:</strong> Does my Perception skill apply?</p>\n<p><strong>GM:</strong> Sure!</p>\n<p><strong>Rickey (rolling a d20):</strong> Ugh. Seven.</p>\n<p><strong>GM:</strong> You can see a couple of them crouching over the ground but you can’t make out what they’re doing. And Drew, Dash is prepping a grenade?</p>\n<p><strong>Drew:</strong> Yup!</p>\n<p><strong>GM:</strong> Okay. Eric, what’s Kodo doing?</p>\n<p><strong>Eric:</strong> …</p>\n<p>adventurers can scale a cliff, roll away from the strike of a Force-wielder’s shock, or pull off some other dangerous task. Anything is possible, but the dice make some outcomes more probable than others.</p>\n<p>In the <em>Star Wars</em> Dungeons and Dragons game, each player creates an adventurer (also called a character) and teams up with other adventurers (played by friends). Working together, the group might explore a planet-encompassing city like Coruscant, the wilds of Kashyyyk, or the war-torn expanse of Oricon. The adventurers can solve puzzles, talk with other characters, battle the legendary Jedi or Sith, and discover special modified items and other treasure.</p>\n<p>One player, however, takes on the role of the Game Master (GM), the game’s lead storyteller and referee. The GM creates adventures for the characters, who navigate its hazards and decide which paths to explore. The GM might describe the entrance to a Black Sun compound, and the players decide what they want their adventurers to do. Will they charge in, guns blazing? Convince the guardsmen they belong there? Or use other means to find an entrance?</p>\n<p>Then the GM determines the results of the adventurers’ actions and narrates what they experience. Because the GM can improvise to react to anything the players attempt, D&#x26;D is infinitely flexible, and each adventure can be exciting and unexpected.</p>\n<p>The game has no real end; when one story or quest wraps up, another one can begin, creating an ongoing story called a <strong>campaign</strong>. Many people who play the game keep their campaigns going for months or years, meeting with their friends every week or so to pick up the story where they left off. The adventurers grow in might as the campaign continues. Each force defeated, each adventure completed, and each relic recovered not only adds to the continuing story, but also earns the adventurers new capabilities. This increase in power is reflected by an adventurer’s level.</p>\n<p>There’s no winning and losing in <em>any</em> Dungeons and Dragons game-at least, not the way those terms are usually understood. Together, the GM and the players create an exciting story of bold adventurers who confront deadly perils. Sometimes an adventurer might come to a grisly end, torn apart by ferocious monsters or done in by a nefarious villain. Even so, the other adventurers can beseech a powerful Jedi to revive their fallen comrade, or the player might choose to create a new character to carry on. The group might fail to complete an adventure successfully, but if everyone had a good time and created a memorable story, they all win.</p>\n<h2 id=\"worlds-of-adventure\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#worlds-of-adventure\"></a><a href=\"https://sw5e.com/rules/phb#worlds-of-adventure\"></a>Worlds of Adventure</h2>\n<p>The many worlds of the <em>Star Wars</em> Dungeons and Dragons game are places of mysticism and monsters, of brave warriors and spectacular adventures. They begin with a foundation of science fiction and fantasy and then add the creatures, places, and mystery that make these worlds unique.</p>\n<p>Naturally, this conversion is designed to explore the myriad worlds of the <em>Star Wars</em> universe. I personally designed it to be used in the Old Republic era as characterized by the <strong>Knights of the Old Republic</strong> games and <strong>The Old Republic</strong> MMORPG. Utilizing this timeframe allows greater justification for a prevalence of force-wielders.</p>\n<p>All these worlds share characteristics, but each world is set apart by its own history and cultures, distinctive monsters and species, fantastic geography, ancient ruins, and scheming villains. Some worlds are dominated by one great story, like the Separatists’ war on Ord Mantell. Ultimately they’re all <em>Star Wars</em> worlds, and you can use the rules in this book to create a character and play in any one of them.</p>\n<p>Your GM might set the campaign on one of these worlds or on one that he or she created. Because there is so much diversity among the worlds of <em>Star Wars</em>, you should check with your GM about any house rules that will affect your play of the game. Ultimately, the Game Master is the authority on the campaign and its setting, even if the setting is a canon world.</p>\n<h2 id=\"using-this-book\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#using-this-book\"></a><a href=\"https://sw5e.com/rules/phb#using-this-book\"></a>Using This Book</h2>\n<p>The <em>Player’s Handbook</em> is divided into twelve chapters.</p>\n<p><strong>Chapters 1-6</strong> are about creating a character, providing the rules and guidance you need to make the character you’ll play in the game. It includes information on the various species, classes, backgrounds, equipment, and other customization options that you can choose from. Many of the rules in these chapters rely on material found later in the book. If you come across a game concept that you don’t understand, consult the book’s table of contents.</p>\n<p><strong>Chapters 7-9</strong> details the rules of how to play the game, beyond the basics described in this introduction. It covers the kinds of die rolls you make to determine success or failure at the tasks your character attempts, and describes the three broad categories of activity in the game: exploration, interaction, and combat.</p>\n<p><strong>Chapters 10-12</strong> is all about the Force and technology. It covers the nature of casting in the worlds of <em>Star Wars</em>, the rules for them, and the huge variety of powers available to characters in the game.</p>\n<h2 id=\"how-to-play\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-to-play\"></a><a href=\"https://sw5e.com/rules/phb#how-to-play\"></a>How to Play</h2>\n<p>The play of the Dungeons and Dragons game unfolds according to this basic pattern.</p>\n<p><strong>1. The GM describes the environment.</strong> The GM tells the players where their adventurers are and what’s around them, presenting the basic scope of options that present themselves (how many doors lead out of a room, what’s on a table, who’s in the cantina, and so on).</p>\n<p><strong>2. The players describe what they want to do.</strong> Sometimes one player speaks for the whole party, saying, “We’ll take the east door,” for example. Other times, different adventurers do different things: one adventurer might search a container while a second examines a symbol engraved on a wall and a third keeps watch for enemies. The players don’t need to take turns, but the GM listens to every player and decides how to resolve those actions.</p>\n<p>Sometimes, resolving a task is easy. If an adventurer wants to walk across a room and open a door, the GM might just say that the door opens and describe what lies beyond. But the door might be locked, the floor might hide a deadly trap, or some other circumstance might make it challenging for an adventurer to complete a task. In those cases, the GM decides what happens, often relying on the roll of a die to determine the results of an action.</p>\n<p><strong>3. The GM narrates the results of the adventurers’ actions.</strong> Describing the results often leads to another decision point, which brings the flow of the game right back to step 1.</p>\n<p>This pattern holds whether the adventurers are cautiously exploring a ruin, talking to a devious noble, or locked in mortal combat against a mighty rancor. In certain situations, particularly combat, the action is more structured and the players (and GM) do take turns choosing and resolving actions. But most of the time, play is fluid and flexible, adapting to the circumstances of the adventure.</p>\n<p>Often the action of an adventure takes place in the imagination of the players and GM, relying on the GM’s verbal descriptions to set the scene. Some GMs like to use music, art, or recorded sound effects to help set the mood, and many players and GMs alike adopt different voices for the various adventurers, monsters, and other characters they play in the game. Sometimes, a GM might lay out a map and use tokens or miniature figures to represent each creature involved in a scene to help the players keep track of where everyone is.</p>\n<h3 id=\"game-dice\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#game-dice\"></a><a href=\"https://sw5e.com/rules/phb#game-dice\"></a>Game Dice</h3>\n<p>The game uses polyhedral dice with different numbers of sides. You can find dice like these in game stores and in many bookstores.</p>\n<p>In these rules, the different dice are referred to by the letter d followed by the number of sides: d4, d6, d8, d 10, d12, and d20. For instance, a d6 is a six-sided die (the typical cube that many games use).</p>\n<p>Percentile dice, or d100, work a little differently. You generate a number between 1 and 100 by rolling two different ten-sided dice numbered from 0 to 9. One die (designated before you roll) gives the tens digit, and the other gives the ones digit. If you roll a 7 and a 1, for example, the number rolled is 71. Two 0s represent 100. Some ten-sided dice are numbered in tens (00, 10, 20, and so on), making it easier to distinguish the tens digit from the ones digit. In this case, a roll of 70 and 1 is 71, and 00 and 0 is 100.</p>\n<p>When you need to roll dice, the rules tell you how many dice to roll of a certain type, as well as what modifiers to add. For example, “3d8 + 5” means you roll three eight-sided dice, add them together, and add 5 to the total.</p>\n<p>The same d notation appears in the expressions “1d5”, “1d3” and “1d2.” To simulate the roll of a d5 or d3, roll a d10 or d6, respectively, and divide the number rolled by 2 (round up). To simulate the roll of 1d2, roll any die and assign a 1 or 2 to the roll depending on whether it was odd or even. (Alternatively, if the number rolled is more than half the number of sides on the die, it’s a 2.)</p>\n<h3 id=\"the-d20\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-d20\"></a><a href=\"https://sw5e.com/rules/phb#the-d20\"></a>The D20</h3>\n<p>Does an adventurer’s vibroblade swing hurt a rancor or just bounce off its leathery hide? Will the guard believe an outrageous bluff? Can a character swim across a raging river? Can a character avoid the main blast of a Sith’s <em>force storm</em>, or does he or she take full damage from the tempest? In cases where the outcome of an action is uncertain, the Dungeons and Dragons game relies on rolls of a 20-sided die, a d20, to determine success or failure.</p>\n<p>Every character and monster in the game has capabilities defined by six <strong>ability scores</strong>. The abilities are Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma, and they typically range from 3 to 18 for most adventurers. (Monsters might have scores as low as 1 or as high as 30.) These ability scores, and the <strong>ability modifiers</strong> derived from them, are the basis for almost every d20 roll that a player makes on a character’s or monster’s behalf.</p>\n<p>Ability checks, attack rolls, and saving throws are the three main kinds of d20 rolls, forming the core of the rules of the game. All three follow these simple steps.</p>\n<p><strong>1. Roll the die and add a modifier.</strong> Roll a d20 and add the relevant modifier. This is typically the modifier derived from one of the six ability scores, and it sometimes includes a proficiency bonus to reflect a character’s particular skill. (See chapter 1 for details on each ability and how to determine an ability’s modifier.)</p>\n<p><strong>2. Apply circumstantial bonuses and penalties.</strong> A class feature, a power, a particular circumstance, or some other effect might give a bonus or penalty to the check.</p>\n<p><strong>3. Compare the total to a target number.</strong> If the total equals or exceeds the target number, the ability check, attack roll, or saving throw is a success. Otherwise, it’s a failure. The GM is usually the one who determines target numbers and tells players whether their ability checks, attack rolls, and saving throws succeed or fail.</p>\n<p>The target number for an ability check or a saving throw is called a <strong>Difficulty Class</strong> (DC). The target number for an attack roll is called an <strong>Armor Class</strong> (AC).</p>\n<p>This simple rule governs the resolution of most tasks in D&#x26;D play. Chapter 7 provides more detailed rules for using the d20 in the game.</p>\n<h3 id=\"advantage-and-disadvantage\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#advantage-and-disadvantage\"></a><a href=\"https://sw5e.com/rules/phb#advantage-and-disadvantage\"></a>Advantage and Disadvantage</h3>\n<p>Sometimes an ability check, attack roll, or saving throw is modified by special situations called <strong>advantage</strong> and <strong>disadvantage</strong>. Advantage reflects the positive circumstances surrounding a die roll, while disadvantage reflects the opposite. When you have either advantage or disadvantage, you roll a second die when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage on a d20 roll, roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17. More detailed rules for advantage and disadvantage are presented in chapter 7.</p>\n<h3 id=\"specific-beats-general\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#specific-beats-general\"></a><a href=\"https://sw5e.com/rules/phb#specific-beats-general\"></a>Specific Beats General</h3>\n<p>This book contains rules, especially in parts 2 and 3, that govern how the game plays. That said, many special traits, class features, powers, unique items, monster abilities, and other game elements break the general rules in some way, creating an exception to how the rest of the game works. Remember this: If a specific rule contradicts a general rule, the specific rule wins.</p>\n<p>Exceptions to the rules are often minor. For instance, many adventurers don’t have proficiency with sniper rifles, but every Chiss does because of a special trait. That trait creates a minor exception in the game. Other examples of rule-breaking are more conspicuous. For instance, an adventurer can’t normally leap 30 feet, but some powers make that possible. The Force and technology account for most of the major exceptions to the rules.</p>\n<h3 id=\"round-appropriately\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#round-appropriately\"></a><a href=\"https://sw5e.com/rules/phb#round-appropriately\"></a>Round Appropriately</h3>\n<p>Follow standard rules for rounding; if a number ends in one-half or greater, round up, while if a number ends in less than one-half, round down.</p>\n<h3 id=\"targets\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#targets\"></a><a href=\"https://sw5e.com/rules/phb#targets\"></a>Targets</h3>\n<p>Many features and powers include specific language on what is a valid target, typically citing ally, friendly creature or hostile creature. The definition of each is included below.</p>\n<h4 id=\"ally\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#ally\"></a><a href=\"https://sw5e.com/rules/phb#ally\"></a>Ally</h4>\n<p>An ally is any creature that would be considered friendly or neutral to you, but does not include you.</p>\n<h4 id=\"friendly-creature\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#friendly-creature\"></a><a href=\"https://sw5e.com/rules/phb#friendly-creature\"></a>Friendly Creature</h4>\n<p>A friendly creature is any creature that could be considered an ally to you, as well as you.</p>\n<h4 id=\"hostile-creature\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#hostile-creature\"></a><a href=\"https://sw5e.com/rules/phb#hostile-creature\"></a>Hostile Creature</h4>\n<p>A hostile creature is any creature that is antagonistic towards you.</p>\n<h2 id=\"adventures\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#adventures\"></a><a href=\"https://sw5e.com/rules/phb#adventures\"></a>Adventures</h2>\n<p>The Dungeons and Dragons game consists of a group of characters embarking on an adventure that the Game Master presents to them. Each character brings particular capabilities to the adventure in the form of ability scores and skills, class features, special traits, equipment, and special items. Every character is different, with various strengths and weaknesses, so the best party of adventurers is one in which the characters complement each other and cover the weaknesses of their companions. The adventurers must cooperate to successfully complete the adventure.</p>\n<p>The adventure is the heart of the game, a story with a beginning, a middle, and an end. An adventure might be created by the Game Master or purchased off the shelf, tweaked and modified to suit the GM’s needs and desires. In either case, an adventure features a wonderous setting, whether it’s an underground enclave, a crumbling temple, a stretch of wilderness, or a bustling city. It features a rich cast of characters: the adventurers created and played by the other players at the table, as well as nonplayer characters (NPCs). Those characters might be patrons, allies, enemies, hirelings, or just background extras in an adventure. Often, one of the NPCs is a villain whose agenda drives much of an adventure’s action.</p>\n<p>Over the course of their adventures, the characters are confronted by a variety of creatures, objects, and situations that they must deal with in some way. Sometimes the adventurers and other creatures do their best to kill or capture each other in combat. At other times, the adventurers talk to another creature (or even a mystical object) with a goal in mind. And often, the adventurers spend time trying to solve a puzzle, bypass an obstacle, find something hidden, or unravel the current situation. Meanwhile, the adventurers explore the world, making decisions about which way to travel and what they’ll try to do next.</p>\n<p>Adventures vary in length and complexity. A short adventure might present only a few challenges, and it might take no more than a single game session to complete. A long adventure can involve hundreds of combats, interactions, and other challenges, and take dozens of sessions to play through, stretching over weeks or months of real time. Usually, the end of an adventure is marked by the adventurers heading back to safety to rest and enjoy the spoils of their labors.</p>\n<p>But that’s not the end of the story. You can think of an adventure as a single episode of a TV series, made up of multiple exciting scenes. A campaign is the whole series-a string of adventures joined together, with a consistent group of adventurers following the narrative from start to finish.</p>\n<h3 id=\"the-force-and-technology\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-force-and-technology\"></a><a href=\"https://sw5e.com/rules/phb#the-force-and-technology\"></a>The Force and Technology</h3>\n<p>Few <em>Star Wars</em> adventures end without interacting with a force- or tech-caster. Whether helpful or harmful, powers appear frequently in the life of an adventurer, and it is the focus of chapters 10, 11, and 12.</p>\n<p>In the worlds of <em>Star Wars</em>, practitioners of the Force are uncommon, set apart from the masses of people by their extraordinary talent.</p>\n<p>For adventurers, though, the Force and technology are key to their survival. Without the healing prowess of a Jedi or a sawbones, adventurers would quickly succumb to their wounds. Without the uplifting support of a scholar, soldiers might be overwhelmed by powerful foes. Without the sheer power and versatility of a consular, every threat would be magnified tenfold.</p>\n<p>The Force and technology are also a favored tool of villains. Many adventures are driven by the machinations of casters who are hell-bent on using power for some ill end. A mercenary leader subjugates the surrounding community, a renegade Sith saps the life from their victims, a vindictive droid takes over a space station with the intent of destroying its oppressors-these are just a few of the threats that adventurers might face. With power of their own, in the form of the Force and special items, the adventurers might prevail!</p>\n<h3 id=\"the-three-pillars-of-adventuring\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-three-pillars-of-adventuring\"></a><a href=\"https://sw5e.com/rules/phb#the-three-pillars-of-adventuring\"></a>The Three Pillars of Adventuring</h3>\n<p>Adventurers can try to do anything their players can imagine, but it can be helpful to talk about their activities in three broad categories: exploration, social interaction, and combat.</p>\n<h4 id=\"exploration\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#exploration\"></a><a href=\"https://sw5e.com/rules/phb#exploration\"></a>Exploration</h4>\n<p>Exploration includes both the adventurers’ movement through the world and their interaction with objects and situations that require their attention. Exploration is the give-and-take of the players describing what they want their characters to do, and the Game Master telling the players what happens as a result. On a large scale, that might involve the characters spending a day crossing the deserts of Tatooine or an hour making their way through the winding passages of an abandoned base. On the smallest scale, it could mean one character flipping a switch in a room to see what happens.</p>\n<p>Social interaction features the adventurers talking to someone (or something) else. It might mean demanding that a captured scout reveal the least well guarded entrance to the mercenary base, getting information from a rescued prisoner, pleading for mercy from the leader of a group of criminals, or persuading an informant to garner information about a distant location.</p>\n<p>The rules in chapters 7 and 8 support exploration and social interaction, as do many class features in chapter 3 and personality traits in chapter 4.</p>\n<h4 id=\"combat\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#combat\"></a><a href=\"https://sw5e.com/rules/phb#combat\"></a>Combat</h4>\n<p>Combat, the focus of chapter 9, involves characters and other creatures swinging weapons, casting powers, maneuvering for position, and so on-all in an effort to defeat their opponents, whether that means killing every enemy, taking captives, or forcing a rout. Combat is the most structured element of a D&#x26;D session, with creatures taking turns to make sure that everyone gets a chance to act. Even in the context of a pitched battle, there’s still plenty of opportunity for adventurers to attempt wacky stunts like surfing down a flight of stairs on a shield, to examine the environment (perhaps by flipping a mysterious switch), and to interact with other creatures, including allies, enemies, and neutral parties.</p>","noteIndex":{"id":"wn8PE1RhG0znK1alrGFYv","title":"Home","desc":"","updated":1677092773137,"created":1631901573363,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"9fe5ffe8639f4d3130538888ddbfc029","links":[{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"sessions","alias":"sessions","position":{"start":{"line":12,"column":3,"offset":228},"end":{"line":12,"column":18,"offset":243},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sessions"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"characters","alias":"characters","position":{"start":{"line":13,"column":3,"offset":246},"end":{"line":13,"column":20,"offset":263},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"characters"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world","alias":"world","position":{"start":{"line":14,"column":3,"offset":266},"end":{"line":14,"column":15,"offset":278},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world.places","alias":"world.places","position":{"start":{"line":15,"column":5,"offset":283},"end":{"line":15,"column":24,"offset":302},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world.places"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world.factions","alias":"world.factions","position":{"start":{"line":16,"column":5,"offset":307},"end":{"line":16,"column":26,"offset":328},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world.factions"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world.objects","alias":"world.objects","position":{"start":{"line":17,"column":5,"offset":333},"end":{"line":17,"column":25,"offset":353},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world.objects"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world.ships","alias":"world.ships","position":{"start":{"line":18,"column":5,"offset":358},"end":{"line":18,"column":23,"offset":376},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world.ships"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"world.species","alias":"world.species","position":{"start":{"line":19,"column":5,"offset":381},"end":{"line":19,"column":25,"offset":401},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"world.species"}},{"type":"wiki","from":{"fname":"root","id":"wn8PE1RhG0znK1alrGFYv","vaultName":"vault"},"value":"game-references","alias":"game-references","position":{"start":{"line":20,"column":3,"offset":404},"end":{"line":20,"column":25,"offset":426},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"game-references"}}],"anchors":{"welcome-to-the-sw5e-wiki":{"type":"header","text":"Welcome to the SW5E Wiki","value":"welcome-to-the-sw5e-wiki","line":10,"column":0,"depth":2},"contents":{"type":"header","text":"Contents","value":"contents","line":16,"column":0,"depth":2}},"children":["a6lywyt55ekyo90nxi6sowf","67nq8r06mptwrwq2iawcqzs","q47io53e2mozudh6em7birq","wgv3ma9aji1ktnezcty7ibh"],"parent":null,"data":{},"body":"\n![](/assets/images/2023-01-08-13-43-38.png)\n\n## Welcome to the SW5E Wiki\n\n- [Home](https://newman174.github.io/sw5e_wiki/)\n- [Github](https://github.com/newman174/sw5e_wiki)\n- [Official Site](https://sw5e.com/)\n\n## Contents\n\n- [[sessions.md]]\n- [[characters.md]]\n- [[world.md]]\n  - [[world.places.md]]\n  - [[world.factions.md]]\n  - [[world.objects.md]]\n  - [[world.ships.md]]\n  - [[world.species.md]]\n- [[game-references.md]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":true,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"dendronVersion":"0.95.0","enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false,"enableHandlebarTemplates":false,"templateHierarchy":"template","enableSmartRefs":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"enableSiteLastModified":true,"siteRootDir":"docs","siteUrl":"https://newman174.github.io","assetsPrefix":"/sw5e_wiki","enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"writeStubs":false,"seo":{"title":"Dendron","description":"Personal knowledge space"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enablePrettyLinks":true,"theme":"dark","enableTaskNotes":true,"templateVersion":"0.97.0","siteFaviconPath":"favicon.ico","siteIndex":"root","searchMode":"lookup"}}},"__N_SSG":true}